app/controllers/questions_controller.rb

INSERT INTO "questions" ("body", "user_id", "created_at", "updated_at", "hidden") VALUES (?, ?, ?, ?, ?)  [["body", "1"], ["user_id", 1], ["created_at", "2022-09-04 23:41:16.180606"], ["updated_at", "2022-09-04 23:41:16.180606"], ["hidden", 0]]
---
  def create
    question_params = params.require(:question).permit(:body, :user_id)

    @question = Question.new(question_params)
    @question.author = current_user

    if @question.save

UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "redirect_toроса с \"Текст вопроса слишком длинный\"\r\n\r\n      render :new"], ["updated_at", "2022-09-05 00:06:31.924529"], ["id", 14]]
---
  def update
    question_params = params.require(:question).permit(:body, :answer)

    if @question.update(question_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if params[:user_id].present?
      user = User.find(params[:user_id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_question_for_current_user
    @question = current_user.questions.find(params[:id])