app/controllers/users_controller.rb

INSERT INTO "users" ("name", "nickname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "nickname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nickname", "cnearing27"], ["updated_at", "2022-09-04 21:49:03.544763"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 14]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

    session.delete(:user_id)